//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// *++
//
// Copyright (c) 2016 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//

//---------------------------------------------------------------------------
// USB CONFIGURATION
//---------------------------------------------------------------------------
//
// USB Configuration
//

/=#

#langdef   en-US "English"

#string STR_UART_CONFIGURATION       #language en-US "UART Configuration"
#string STR_UART_CONFIGURATION_HELP  #language en-US "UART Configuration"

#string STR_EFI_HSUART_MODE               #language en-US "HSUART MODE"
#string STR_EFI_HSUART_MODE_HELP          #language en-US "PCIE: Enumeration assigns dinamically the MMIO/IO resources \nLegacy: PCIE enumeration is avoided, IO resources are assigned upon setup option \nHide: No resource assigned"

#string STR_EFI_HSUART_MODE_PCIE               #language en-US "PCIE"
#string STR_EFI_HSUART_MODE_LEGACY             #language en-US "Legacy"
#string STR_EFI_HSUART_MODE_HIDE               #language en-US "Hide"

#string STR_EFI_LEGACY_UART_EN       #language en-US "Enables legacy uart"
#string STR_EFI_LEGACY_UART_EN_HELP  #language en-US "Enables legacy uart (COMx) and avoids PCIe enumeration"

#string STR_EFI_HSUART_0             #language en-US "HSUART 0"
#string STR_EFI_HSUART_1             #language en-US "HSUART 1"
#string STR_EFI_HSUART_2             #language en-US "HSUART 2"
#string STR_EFI_HSUART_3             #language en-US "HSUART 3"

#string STR_EFI_HSUART_COM_VALUE      #language en-US "COM Selection"
#string STR_EFI_HSUART_COM_VALUE_HELP #language en-US "Sets the COM value. Be sure to no repeat the COM value with other HSUART COM values selected"

#string STR_EFI_HSUART_HIDE           #language en-US "Hide"
#string STR_EFI_HSUART_HIDE_HELP      #language en-US "Hides the selected HSUART."



#string STR_EFI_COM1      #language en-US "COM1"
#string STR_EFI_COM2      #language en-US "COM2"
#string STR_EFI_COM3      #language en-US "COM3"
#string STR_EFI_COM4      #language en-US "COM4"

// Denverton Aptiov override start
// DBG2 ACPI table is installed by "Debug Port Tables" module   
//#string STR_EFI_HSUART_KD_PORT               #language en-US "HSUART Kernel Debug Port"
//#string STR_EFI_HSUART_KD_PORT_HELP			 #language en-US "HSUART Kernel Debug Port Selection"
//#string STR_EFI_HSUART_DEBUG_MODE            #language en-US "MDPT install"
//#string STR_EFI_HSUART_DEBUG_MODE_HELP       #language en-US "If enabled, MDPT table is installed to allow debug on PCIE HSUART"
// Denverton Aptiov override End

//
// End of file
//
